/////////////////////////////////////////////////////////////////////Level MINIMUM
/*TASK 1*/
console.log(`Результат операції 0.1 + 0.2 рівний ${(0.1 + 0.2).toFixed(1)}`);
//Another one variant answer
console.log(
  `Результат операції 0.1 + 0.2 рівний ${Math.floor((0.1 + 0.2) * 10) / 10}`
);

/*TASK 2*/
let num_1 = "1";
let num_2 = 2;
console.log(`Сума чисел ${num_1} і ${num_2} рівна  ${+num_1 + num_2}`);
//Another one variant answer
console.log(`Сума чисел ${num_1} і ${num_2} рівна  ${Number(num_1) + num_2}`);
/*TASK 2*/
let flashSize = prompt("Enter your flash size in Gb", 0);
let fileSize = "820Mb";
//Виведе результат максимально точний, враховуючи цифри після коми
alert(
  `На флеш пам'ять розміром ${flashSize}Gb Ви можете розмістити ${
    (flashSize * 1000 * 1000 * 1000) / (parseInt(fileSize) * 1024 * 1024)
  } файлів розміром 820Mb`
);
//Виведе кількість цілих файлів, які можливо зберегти на флешці
alert(
  `На флеш пам'ять розміром ${flashSize}Gb Ви можете розмістити  ${Math.floor(
    (flashSize * 1000 * 1000 * 1000) / (parseInt(fileSize) * 1024 * 1024)
  )}  файлів розміром 820Mb`
);
/////////////////////////////////////////////////////////////////////Level NORMA
/*TASK 1*/
let userCountMoney = prompt("Введіть доступну Вам суму грошей", 0);
let chocolatePrise = prompt("Ведіть ціну шоколадки", 0);
alert(
  `Ви можете купити ${Math.floor(
    userCountMoney / chocolatePrise
  )} шоколадок і у Вас залишиться ${(userCountMoney % chocolatePrise).toFixed(
    2
  )} гривень`
);
/*TASK 2*/
let threeCyberNum = prompt("Введіть число в діапазоні від 100 до 999");
//Рішення 1
alert(
  `Введене Вами число ${threeCyberNum} в зворотньому порядку матиме вигляд ${
    threeCyberNum[2] + threeCyberNum[1] + threeCyberNum[0]
  }`
);
//Рішення 2
let hundreds = Math.floor(threeCyberNum / 100);
let tenses = Math.floor(threeCyberNum / 10) % 10;
let ones = Math.floor(threeCyberNum % 10);
alert(
  `Введене Вами число ${threeCyberNum} в зворотньому порядку матиме вигляд ${ones}${tenses}${hundreds}
  `
);
/////////////////////////////////////////////////////////////////////Level MAXIMUM
/*TASK 1*/
let depositSum = prompt("Введіть суму депозиту");
const baseIntRate = "5%";
let userIntRate = parseInt(baseIntRate) / 12;
alert(
  `Сума відсотків отриманих за 2 місяці від депозиту розміром ${depositSum}$ при річній ставці ${baseIntRate} становитиме ${
    (depositSum * userIntRate) / 100
  } $`
);
/*TASK 2*/
//Всі 3 вирази читаються по порядку зліва на право
// Вираз  2 && 0 && 3    поверне 0
/*Пояснення. Оператор && поверне true лише коли два операнди будуть true. В нашому випадку цифра 2 в булевому еквіваленті рівна  
true, a 0 дорівнює false, отже результатом порівняння 2 && 0 буде 0. Наступний етап порівнюємо результат першого порівняння з цифрою 3.
Цифра 3 в булевому еквіваленті рівна true. Отже результат виразу 0 && 3 буде рівним 0*/

//Вираз  2 || 0 || 3      поверне 2
/*Пояснення. Оператор || поверне true якщо хоча б один з операндів рівний true, а якщо обидва операнда рівні true тоді буде повернуто 
перше значення. Звідси виходить, що вираз 2 || 0 поверне 2, бо 2 в булевому еквіваленті дорівнює true, a 0 false. Потім порівнюємо результат
першої частини виразу з другою частиною. 2 || 3 поверне 2, бо цифри 2 і 3 в булевому еквіваленті рівні true, а оскільки 2 у даному виразі
йде першою по порядку то результат виразу буде 2
 */

//Вираз 2 && 0 || 3     поверне 3
/*Пояснення. Виходячи з вище наведених правил результат операціі 2 && 0 буде 0, а остаточний результат операції порівняння рівний 3 */
